Tugas2/results/testing.txt/ab-1-500-testing.txt.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      1
Time taken for tests:   507.104 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      79500 bytes
HTML transferred:       11000 bytes
Requests per second:    0.99 [#/sec] (mean)
Time per request:       1014.207 [ms] (mean)
Time per request:       1014.207 [ms] (mean, across all concurrent requests)
Transfer rate:          0.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:   251 1014 481.5    946    2790
Waiting:      246  989 468.8    933    2773
Total:        251 1014 481.5    947    2790

Percentage of the requests served within a certain time (ms)
  50%    947
  66%   1139
  75%   1255
  80%   1400
  90%   1706
  95%   1927
  98%   2245
  99%   2413
 100%   2790 (longest request)