Tugas2/results/testing.txt/ab-10-100-testing.txt.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      10
Time taken for tests:   61.839 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      15900 bytes
HTML transferred:       2200 bytes
Requests per second:    1.62 [#/sec] (mean)
Time per request:       6183.927 [ms] (mean)
Time per request:       618.393 [ms] (mean, across all concurrent requests)
Transfer rate:          0.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  852 1828.9      0   15297
Processing:  1652 4427 1189.4   4350    7667
Waiting:     1646 4349 1161.0   4287    7516
Total:       1652 5279 2077.5   5137   19647

Percentage of the requests served within a certain time (ms)
  50%   5137
  66%   5640
  75%   5959
  80%   6121
  90%   7017
  95%   8554
  98%   9428
  99%  19647
 100%  19647 (longest request)