Tugas2/results/testing.txt/ab-5-500-testing.txt.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      5
Time taken for tests:   292.436 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      79500 bytes
HTML transferred:       11000 bytes
Requests per second:    1.71 [#/sec] (mean)
Time per request:       2924.362 [ms] (mean)
Time per request:       584.872 [ms] (mean, across all concurrent requests)
Transfer rate:          0.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   11 103.4      0    1075
Processing:   855 2892 933.1   2775    6398
Waiting:      717 2819 919.2   2707    6312
Total:        855 2902 942.6   2800    7415

Percentage of the requests served within a certain time (ms)
  50%   2800
  66%   3183
  75%   3370
  80%   3584
  90%   4128
  95%   4692
  98%   5394
  99%   5830
 100%   7415 (longest request)